10/app/views/articles/index.html.erb

SELECT `tags`.* FROM `tags` WHERE (LOWER(name) = LOWER('mysql'))
---
        <td><%= article.text %></td>
        <td><%= raw article.tag_list.map { |t| link_to t, tag_path(t) }.join{', '} %></td>