10/app/controllers/articles_controller.rb

  def index
    if params[:tag]
      @articles = Article.tagged_with(params[:tag])

      else
    @articles = Article.all
---
SELECT `articles`.* FROM `articles` JOIN taggings articles_taggings_f460c88  ON articles_taggings_f460c88.taggable_id = articles.id AND articles_taggings_f460c88.taggable_type = 'Article' AND articles_taggings_f460c88.tag_id = 1
SELECT `tags`.* FROM `tags` WHERE (LOWER(name) = LOWER('mysql'))